/***********************************************************************************************************************
 * Created by caffe on 2019/11/20.
 * 762. 二进制表示中质数个计算置位
 * 给定两个整数 L 和 R ，找到闭区间 [L, R] 范围内，计算置位位数为质数的整数个数。

    （注意，计算置位代表二进制表示中1的个数。例如 21 的二进制表示 10101 有 3 个计算置位。还有，1 不是质数。）

    示例 1:

    输入: L = 6, R = 10
    输出: 4
    解释:
    6 -> 110 (2 个计算置位，2 是质数)
    7 -> 111 (3 个计算置位，3 是质数)
    9 -> 1001 (2 个计算置位，2 是质数)
    10-> 1010 (2 个计算置位，2 是质数)

    示例 2:

    输入: L = 10, R = 15
    输出: 5
    解释:
    10 -> 1010 (2 个计算置位, 2 是质数)
    11 -> 1011 (3 个计算置位, 3 是质数)
    12 -> 1100 (2 个计算置位, 2 是质数)
    13 -> 1101 (3 个计算置位, 3 是质数)
    14 -> 1110 (3 个计算置位, 3 是质数)
    15 -> 1111 (4 个计算置位, 4 不是质数)

    注意:

        L, R 是 L <= R 且在 [1, 10^6] 中的整数。
        R - L 的最大值为 10000。
 **********************************************************************************************************************/
/**
 * solution 1 : 分析法
 * 由于数据给出的范围是[1,10^6]大概为1024*1024，也就是一共有20个2进制位，因此只需要数出某个数中1的个数再看是不是质数就行。
 * 时间复杂度：O（n）
 * 空间复杂度： O（1）
 */
class Solution {
public:
    int countPrimeSetBits(int L, int R) {
        int ans=0;
        for(int i=L;i<=R;++i){
            int n=bitCount(i);
            ans+=isPrime(n);
        }
        return ans;
    }
    int bitCount(int num){
        int count=0;
        while(num){
            ++count;
            num=num&(num-1);
        }
        return count;
    }
    int isPrime(int num){
        if((num==2) || (num==3) || num==5 || num==7 || num==11 || num==13 || num==17 || num==19) return 1;
        else return 0;
    }
};