/***********************************************************************************************************************
 * Created by caffe on 2019/10/31.
 * 题干：
        Given a string s, partition s such that every substring of the partition is a palindrome.
        Return all possible palindrome partitioning of s.
 * 解法一：DFS（深度优先遍历）
        既然题目要求找到所有可能拆分成回文数的情况，那么肯定所有组合都要遍历到，而且对于每一个子字符串都要进行一次是否为回文数的判断。

 **********************************************************************************************************************/
