/***********************************************************************************************************************
 * Created by caffe on 2019/12/12.
 * 91. 解码方法
 * 一条包含字母 A-Z 的消息通过以下方式进行了编码：

    'A' -> 1
    'B' -> 2
    ...
    'Z' -> 26

    给定一个只包含数字的非空字符串，请计算解码方法的总数。
 **********************************************************************************************************************/
/**
 * solution 1 : 动态规划
 * 时间复杂度：O（n）
 * 空间复杂度：O（n）
 */
class Solution {
public:
    int numDecodings(string s) {
        int n=s.size();
        if(s[0]=='0') return 0;
        if(n<2) return s[0]=='0' ? 0:1;
        vector<int> dp(n,0);
        dp[0]=1;
        int sum=(s[0]-'0')*10+s[1]-'0';

        if (s[1]=='0'&&(s[0]=='0'||(s[0]!='1'&&s[0]!='2'))) return 0;
        else if(s[0]=='1'&&s[1]!='0') dp[1]=2;
        else if (s[0]=='2'&&s[1]>='1'&&s[1]<='6') dp[1]=2;
        else dp[1]=1;

        for(int i=2;i<n;++i){
            if(s[i]=='0'){
                if(s[i-1]=='1'||s[i-1]=='2') dp[i]=dp[i-2];
                else return 0;
            }else if(s[i-1]=='1'||(s[i-1]=='2'&&s[i]>='1'&&s[i]<='6')){
                dp[i]=dp[i-1]+dp[i-2];
            }else dp[i]=dp[i-1];
        }
        return dp[n-1];
    }
};